{
  "1984": "Roman distopic de George Orwell despre o societate supravegheată de Big Brother. Winston Smith lucrează la Ministerul Adevărului și începe o revoltă interioară împotriva manipulării. Explorează teme precum controlul social, rescrierea istoriei și pierderea intimității.",
  "The Hobbit": "Bilbo Baggins, un hobbit comod, pleacă alături de pitici într-o misiune pentru a recupera comoara furată de Smaug. Pe drum, întâlnește troli, elfi și găsește un inel misterios. O poveste despre curaj, prietenie și ieșirea din zona de confort.",
  "To Kill a Mockingbird": "Harper Lee surprinde copilăria lui Scout Finch într-un orășel din Alabama. Tatăl ei, Atticus, apără un bărbat de culoare acuzat pe nedrept. Cartea abordează prejudecățile rasiale, moralitatea și empatia.",
  "Pride and Prejudice": "Jane Austen satirizează moravurile sociale și clasele din Anglia secolului XIX. Elizabeth Bennet și Mr. Darcy trec prin neînțelegeri și orgolii. Tema centrală este descoperirea de sine și iubirea autentică.",
  "The Catcher in the Rye": "Holden Caulfield relatează, cu umor și cinism, deriva sa prin New York. Se confruntă cu ipocrizia lumii adulte și caută sens. Tema alienării și dorința de protejare a inocenței domină romanul.",
  "Brave New World": "Aldous Huxley imaginează o societate hedonistă susținută de tehnologie, condiționare și drogul soma. Individul este subordonat stabilității sociale. Romanul ridică întrebări despre libertate, fericire și umanitate.",
  "The Lord of the Rings": "J.R.R. Tolkien urmărește lupta dintre bine și rău într-un univers vast. Frodo și Călăreții Inelului pornesc într-o misiune pentru a distruge Inelul Unic. Cartea subliniază prietenia, sacrificiul și speranța.",
  "Fahrenheit 451": "Ray Bradbury prezintă o lume în care cărțile sunt arse pentru a menține conformismul. Pompierul Montag devine curios și începe să citească pe ascuns. Teme: cenzură, mass-media și gândirea critică.",
  "Moby-Dick": "Herman Melville spune povestea căpitanului Ahab, obsedat să vâneze balena albă. Romanul combină aventură maritimă cu reflecții filosofice. Obsesia și destinul sunt motivele dominante.",
  "War and Peace": "Lev Tolstoi urmărește destinele familiilor Rostov, Bolkonski și Bezukhov pe fundalul războaielor napoleoniene. Romanul îmbină istorie, dragoste și reflecții despre timp și schimbare. Este o frescă monumentală a societății ruse.",
  "The Name of the Rose": "Umberto Eco combină romanul istoric cu thrillerul intelectual. Călugărul William din Baskerville investighează crime misterioase într-o mănăstire. Cartea discută despre interpretare, putere și accesul la cunoaștere."
}
